// Карты...
##
var m := ReadInteger('Укажите масть (1 - 4)):');
var k := ReadInteger('Укажите достоинство карты (6 - 14):');

case k of 
  6: Print('Шестерка');
  7: Print('Семерка');
  8: Print('Восьмерка');
  9: Print('Девятка');
  10: Print('Десятка');
  11: Print('Валет');
  12: Print('Дама');
  13: Print('Король');
  14: Print('Туз');
else
  Print('Достоинство карты указано неверно');
end;

case m of
  1: Print('пик');
  2: Print('треф');
  3: Print('бубен');
  4: Print('червей')
else
  Print('Масть карты указана неверно');
end;